LEXICON_RU: dict[str: str] = {
    'start': '<b>Чего желаешь?</b>',
    'pay': '<b>Выберите подписку</b>',
    'confirm_pay': '<b>С вашего баланса спишется {amount}$</b>',
    'balance': '<b>Ваш баланс: {balance}$</b>',
    'topup_start': '<b>TRC20 USDT:</b>\n<i>{address}</i>\n\nПосле оплаты отправьте сюда хэш транзакции!',
    'topup_done': '<b>Баланс пополнен на {amount}$!</b>',
    'topup_wrong': '<b>Ошибка хэша!</b> Возможные причины:\n\n'
                    '• Неверный хэш\n• Транзакция еще идет\n• Введен не хэш',
    'other': 'IDK',
    'pay_btn': 'Оплатить 💲',
    'balance_btn': 'Баланс 💰',
    'topup_btn': 'Пополнить',
    '14d_btn': '14d - 29$',
    '30d_btn': '30d - 49$',
    'confirm_btn': 'Подтверждаю ✔',
    'backward': '❌'
}